Revit 2027 API
BuiltInFailures.StairRampFailures.CannotMakeLanding Property
 Can't make landing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeLanding { get; }
Public Shared ReadOnly Property CannotMakeLanding As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeLanding {
	FailureDefinitionId^ get ();
}
static member CannotMakeLanding : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace